Tuomaaa/XDriveSLAMRover/stm32/Core/Inc/main.h
/* USER CODE BEGIN Header */
/**
  ******************************************************************************
  * @file           : main.h
  * @brief          : Header for main.c file.
  *                   This file contains the common defines of the application.
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2026 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  */
/* USER CODE END Header */

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef __MAIN_H
#define __MAIN_H

#ifdef __cplusplus
extern "C" {
#endif

/* Includes ------------------------------------------------------------------*/
#include "stm32f4xx_hal.h"

/* Private includes ----------------------------------------------------------*/
/* USER CODE BEGIN Includes */

/* USER CODE END Includes */

/* Exported types ------------------------------------------------------------*/
/* USER CODE BEGIN ET */

/* USER CODE END ET */

/* Exported constants --------------------------------------------------------*/
/* USER CODE BEGIN EC */

/* USER CODE END EC */

/* Exported macro ------------------------------------------------------------*/
/* USER CODE BEGIN EM */

/* USER CODE END EM */

void HAL_TIM_MspPostInit(TIM_HandleTypeDef *htim);

/* Exported functions prototypes ---------------------------------------------*/
void Error_Handler(void);

/* USER CODE BEGIN EFP */

/* USER CODE END EFP */

/* Private defines -----------------------------------------------------------*/
#define TRIG_Pin GPIO_PIN_4
#define TRIG_GPIO_Port GPIOA
#define Motor1_1_Pin GPIO_PIN_0
#define Motor1_1_GPIO_Port GPIOB
#define Motor1_2_Pin GPIO_PIN_1
#define Motor1_2_GPIO_Port GPIOB
#define Motor2_1_Pin GPIO_PIN_2
#define Motor2_1_GPIO_Port GPIOB
#define Motor2_2_Pin GPIO_PIN_10
#define Motor2_2_GPIO_Port GPIOB
#define Motor3_1_Pin GPIO_PIN_12
#define Motor3_1_GPIO_Port GPIOB
#define Motor3_2_Pin GPIO_PIN_13
#define Motor3_2_GPIO_Port GPIOB
#define Motor4_1_Pin GPIO_PIN_14
#define Motor4_1_GPIO_Port GPIOB
#define Motor4_2_Pin GPIO_PIN_15
#define Motor4_2_GPIO_Port GPIOB
#define INT_Pin GPIO_PIN_8
#define INT_GPIO_Port GPIOB
#define INT_EXTI_IRQn EXTI9_5_IRQn
#define CS_Pin GPIO_PIN_9
#define CS_GPIO_Port GPIOB

/* USER CODE BEGIN Private defines */

/* USER CODE END Private defines */

#ifdef __cplusplus
}
#endif

#endif /* __MAIN_H */
